Autodesk.Revit.DB.ReferenceIntersector.SetTargetElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the set of ElementIds to test from in intersection testing.
elementIds:
The target ElementIds.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.GetTargetElementIds
Gets the set of ElementIds to test from in intersection testing.
Returns:
The target ElementIds.
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.SetFilter(Autodesk.Revit.DB.ElementFilter)
Sets the ElementFilter used in intersection testing.
filter:
The ElementFilter.  Pass null to remove the existing filter.
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.GetFilter
Gets the ElementFilter used in intersection testing.
Returns:
The ElementFilter, or null if no filter is set.
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.FindNearest(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Projects a ray from the origin along the given direction, and returns the nearest reference from intersected elements which match the ReferenceIntersector's criteria.
Remarks:
Note that FindNearest() is a convenience method, and other references that may be nearly the same distance from the origin can be obtained from Autodesk.Revit.DB.ReferenceIntersector.Find(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ).
origin:
The origin of the ray.
direction:
The direction of the ray.
Returns:
The intersected reference nearest to the ray origin, null if none is found
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.Find(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Projects a ray from the origin along the given direction, and returns all references from intersected elements which match the ReferenceIntersector's criteria.
origin:
The origin of the ray.
direction:
The direction of the ray.
Returns:
A collection containing the intersected references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ReferenceIntersector.FindReferencesInRevitLinks
Determines if references inside Revit Links should be found.
Remarks:
If set to false, no Reference to any Element from a Revit Link will be found by the ReferenceIntersector,
and you can be certain that any Reference returned will be to a host document Element only.  If set to true,
the results may include both References to Elements in hosts and References to Elements from a link
instance.
Setting this value to true may interact with some other settings on the ReferenceIntersector.  If a list of target ElementIds is set,
references will be returned only if the ElementId matches the id of the intersected RevitLinkInstance.  If there is a match, any intersecting
elements in the link will be returned (their ids will not be compared with the target ids list).  If there is an ElementFilter
applied, the elements in the link will be evaluated against the stored ElementFilter.
Note that results may not be as expected if the filter applied is geometric (such as a BoundingBox filter or ElementIntersects filter).
This is because the filter will be evaluated for linked elements in the coordinates of the linked model, which may not match the coordinates
of the elements as they appear in the host model.  Also, ElementFilters that accept a Document and/or ElementId as input during
their instantiation will not correctly pass elements that appear in the link, because the filter will not be able to match link elements to
the filter's criteria.
Since:
2014

Autodesk.Revit.DB.ReferenceIntersector.TargetType
The type of reference to find.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.ViewId
The id of the 3D view used for evaluation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: viewId is not the id of a 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.ElementFilter,Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter.
filter:
The element filter.   All references will belong to elements passing this filter.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View cannot be a template view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from any of a set of target elements.
targetElementIds:
The target element ids.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View cannot be a template view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.FindReferenceTarget,Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from a single target element only.
targetElementId:
The target element id.
targetType:
The target type of references to return.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View cannot be a template view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector.#ctor(Autodesk.Revit.DB.View3D)
Constructs a ReferenceIntersector which is set to return intersections from all elements and representing all reference target types.
view3d:
The view in which to find references.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View cannot be a template view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ReferenceIntersector
A class used to find and return elements that intersect a ray created from an origin point and direction.
Remarks:
An instance of this class can be constructed to return any 3D geometric element that intersects the
ray created by the origin and direction, or to return a subset of elements based on filtering and flags.
The caller can opt to filter the results using an ElementFilter, or by applying a specific list of
acceptable elements.  The caller can also specify the type of object to be returned, which might be
whole elements, geometry objects, or a combination.  In all cases the caller is required to supply
a 3D view for evaluation; the view and visibility settings on the input view will determine if a
particular element is returned (for example, hidden elements will never be returned by this tool, nor
will elements whose geometry is outside the section box of the view).
The class is configured so that a single instance can be constructed and used for multiple evaluations of
different rays.  The results of the evaluation are not preserved between invocations on the same ReferenceIntersector.
The class also offers an option to return element results encountered in Revit Links.  When the
Autodesk.Revit.DB.ReferenceIntersector.FindReferencesInRevitLinks flag
is set, the results may include elements in the host document and in any RevitLinkInstance encountered, depending
on the other flags set.  See the remarks for Autodesk.Revit.DB.ReferenceIntersector.FindReferencesInRevitLinks for details on how the
flags affect the results obtained from links.
Since:
2013